; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v4 ?v6)
             (pred_6 ?v11 ?v2)
             (pred_10 ?v4 ?v2)
             (pred_11 ?v12 ?v4 )
	     (pred_5 ?v4)
             (pred_12 ?v13)
             (pred_1 ?v11)
             (pred_7 ?v2)
             (pred_4 ?v4)
             (pred_2 ?v11)
             (pred_9 ?v4)
             (pred_8 ))



(:action op_2
:parameters (?v8 ?v9 ?v5 ?v10)
:precondition (and (pred_12 ?v8) (pred_12 ?v9) (pred_1 ?v5) (pred_7 ?v10)
          (pred_3 ?v8 ?v9) (pred_6 ?v5 ?v10)
                   (pred_10 ?v9 ?v10) (pred_5 ?v8) 
                   (pred_4 ?v9) (pred_2 ?v5))
:effect (and  (pred_9 ?v9) (not (pred_4 ?v9))))


(:action op_5
:parameters (?v8 ?v7)
:precondition (and (pred_12 ?v8) (pred_12 ?v7)
               (pred_5 ?v8) (pred_3 ?v8 ?v7) (pred_9 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v8))))

(:action op_1
:parameters (?v8 ?v5)
:precondition (and (pred_12 ?v8) (pred_1 ?v5) 
                  (pred_5 ?v8) (pred_11 ?v5 ?v8) (pred_8 ))
:effect (and (pred_2 ?v5)
   (not (pred_11 ?v5 ?v8)) (not (pred_8 ))))


(:action op_3
:parameters (?v8 ?v1 ?v3)
:precondition (and (pred_12 ?v8) (pred_1 ?v1) (pred_1 ?v3)
                  (pred_5 ?v8) (pred_2 ?v3) (pred_11 ?v1 ?v8))
:effect (and (pred_2 ?v1) (pred_11 ?v3 ?v8)
        (not (pred_2 ?v3)) (not (pred_11 ?v1 ?v8))))

(:action op_4
:parameters (?v8 ?v5)
:precondition (and (pred_12 ?v8) (pred_1 ?v5) 
                  (pred_5 ?v8) (pred_2 ?v5))
:effect (and (pred_8 ) (pred_11 ?v5 ?v8) (not (pred_2 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_12 obj_22 obj_19 obj_07 obj_11 obj_28 obj_30 obj_03 obj_05 obj_02 obj_20 obj_13 obj_01 obj_08 obj_29 obj_23 obj_26 obj_10 obj_14 obj_27 obj_16 obj_24 obj_18 obj_25
    obj_21 obj_06
    obj_17 obj_04 obj_15
    )

    (:init
       (pred_8)

       (pred_12 obj_09)
       (pred_12 obj_12)
       (pred_12 obj_22)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_11)
       (pred_12 obj_28)
       (pred_12 obj_30)
       (pred_12 obj_03)
       (pred_12 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_20)
       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_29)
       (pred_12 obj_23)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_14)
       (pred_12 obj_27)
       (pred_12 obj_16)
       (pred_12 obj_24)
       (pred_12 obj_18)
       (pred_12 obj_25)
       (pred_7 obj_21)
       (pred_7 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_04)
       (pred_1 obj_15)

       (pred_3 obj_09 obj_11)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_12 obj_28)
       (pred_3 obj_12 obj_22)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_22 obj_30)
       (pred_3 obj_22 obj_19)
       (pred_3 obj_22 obj_12)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_19 obj_07)
       (pred_3 obj_19 obj_22)
       (pred_3 obj_07 obj_05)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_28)
       (pred_3 obj_11 obj_09)
       (pred_3 obj_28 obj_20)
       (pred_3 obj_28 obj_30)
       (pred_3 obj_28 obj_12)
       (pred_3 obj_28 obj_11)
       (pred_3 obj_30 obj_13)
       (pred_3 obj_30 obj_03)
       (pred_3 obj_30 obj_22)
       (pred_3 obj_30 obj_28)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_03 obj_19)
       (pred_3 obj_03 obj_30)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_05 obj_07)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_02 obj_29)
       (pred_3 obj_02 obj_20)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_20 obj_23)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_28)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_30)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_01 obj_10)
       (pred_3 obj_01 obj_08)
       (pred_3 obj_01 obj_03)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_01)
       (pred_3 obj_29 obj_27)
       (pred_3 obj_29 obj_23)
       (pred_3 obj_29 obj_02)
       (pred_3 obj_23 obj_16)
       (pred_3 obj_23 obj_26)
       (pred_3 obj_23 obj_20)
       (pred_3 obj_23 obj_29)
       (pred_3 obj_26 obj_24)
       (pred_3 obj_26 obj_10)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_23)
       (pred_3 obj_10 obj_18)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_10 obj_01)
       (pred_3 obj_10 obj_26)
       (pred_3 obj_14 obj_25)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_27 obj_16)
       (pred_3 obj_27 obj_29)
       (pred_3 obj_16 obj_24)
       (pred_3 obj_16 obj_23)
       (pred_3 obj_16 obj_27)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_24 obj_26)
       (pred_3 obj_24 obj_16)
       (pred_3 obj_18 obj_25)
       (pred_3 obj_18 obj_10)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_25 obj_14)
       (pred_3 obj_25 obj_18)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_22)
       (pred_10  obj_13 obj_21)
       (pred_10  obj_12 obj_06)
       (pred_10  obj_22 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_19)
       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_28)
       (pred_9 obj_30)
       (pred_9 obj_03)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_20)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_29)
       (pred_9 obj_23)
       (pred_9 obj_26)
       (pred_9 obj_10)
       (pred_9 obj_14)
       (pred_9 obj_27)
       (pred_9 obj_16)
       (pred_9 obj_24)
       (pred_9 obj_18)
       (pred_9 obj_25)

       (pred_6  obj_17 obj_21)
       (pred_6  obj_04 obj_06)
       (pred_6  obj_15 obj_21)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_04 obj_24)
       (pred_11 obj_15 obj_24)
       (pred_5 obj_07)
    )

    (:goal (and
       (pred_11 obj_17 obj_25)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_15 obj_19)
    ))
(:constraints
  (always (not (pred_5 obj_23)))
)
)

; plan
1. (op_5 obj_07 obj_19)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_19)
   goals met: 0 of 3
2. (op_5 obj_19 obj_03)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_03)
   goals met: 0 of 3
3. (op_5 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_01)
   goals met: 0 of 3
4. (op_5 obj_01 obj_10)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_10)
   goals met: 0 of 3
5. (op_5 obj_10 obj_18)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_18)
   goals met: 0 of 3
6. (op_1 obj_18 obj_17)
   deleted: (pred_11 obj_17 obj_18) (pred_8)
   added: (pred_2 obj_17)
   goals met: 0 of 3
7. (op_5 obj_18 obj_25)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_25)
   goals met: 0 of 3
8. (op_4 obj_25 obj_17)
   deleted: (pred_2 obj_17)
   added: (pred_8) (pred_11 obj_17 obj_25)
   goals met: 1 of 3
9. (op_5 obj_25 obj_18)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_18)
   goals met: 1 of 3
10. (op_5 obj_18 obj_24)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_24)
   goals met: 1 of 3
11. (op_1 obj_24 obj_04)
   deleted: (pred_11 obj_04 obj_24) (pred_8)
   added: (pred_2 obj_04)
   goals met: 1 of 3
12. (op_5 obj_24 obj_16)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_16)
   goals met: 1 of 3
13. (op_4 obj_16 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_8) (pred_11 obj_04 obj_16)
   goals met: 2 of 3
14. (op_5 obj_16 obj_24)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_24)
   goals met: 2 of 3
15. (op_1 obj_24 obj_15)
   deleted: (pred_11 obj_15 obj_24) (pred_8)
   added: (pred_2 obj_15)
   goals met: 2 of 3
16. (op_5 obj_24 obj_26)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_26)
   goals met: 2 of 3
17. (op_5 obj_26 obj_10)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_10)
   goals met: 2 of 3
18. (op_5 obj_10 obj_01)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_01)
   goals met: 2 of 3
19. (op_5 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 2 of 3
20. (op_5 obj_03 obj_19)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_19)
   goals met: 2 of 3
21. (op_4 obj_19 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_8) (pred_11 obj_15 obj_19)
   goals met: 3 of 3
